In [ ]:
## Python code to demonstrate table creation and
# insertions with SQL

# importing module
import sqlite3

# connecting to the database
connection = sqlite3.connect("myTable.db")

# cursor
crsr = connection.cursor()

In [ ]:
import pandas as pd

def print_clean(res):
  cnames = list(map(lambda x: x[0], crsr.description))
  print(pd.DataFrame(res,columns = cnames))

In [ ]:
# create table emp and proj
# SQL command to create a table in the database
sql_command = """CREATE TABLE emp( EID INTEGER,
name VARCHAR(30));"""

# execute the statement
crsr.execute(sql_command)

OperationalError: ignored

In [ ]:
sql_command = """CREATE TABLE proj( EID INTEGER,
name VARCHAR(30));"""

# execute the statement
crsr.execute(sql_command)

OperationalError: ignored

In [ ]:
## insert rows in these 2 tables

emp_dict = {"Name":["Ankit", "Balram", "Chandu","Dashrath"], "EID":[1,2,3,4]}
for name, eid in zip(emp_dict["Name"], emp_dict["EID"]):
  # SQL command to insert the data in the table
  sql_command = f"""INSERT INTO emp VALUES ('{eid}', '{name}');"""
  crsr.execute(sql_command)

proj_dict = {"Name":["P1", "P1", "P2", "P2", "P3", "P4", "P5", "P5"], "EID":[1,2,3,1,2,1,3,5]}
for name, eid in zip(proj_dict["Name"], proj_dict["EID"]):
  # SQL command to insert the data in the table
  sql_command = f"""INSERT INTO proj VALUES ('{eid}', '{name}');"""
  crsr.execute(sql_command)

connection.commit()

In [ ]:
print_clean(crsr.execute("SELECT * FROM emp").fetchall())

    EID      name
0     1     Ankit
1     2    Balram
2     3    Chandu
3     4  Dashrath
4     1     Ankit
5     2    Balram
6     3    Chandu
7     4  Dashrath
8     1     Ankit
9     2    Balram
10    3    Chandu
11    4  Dashrath

In [ ]:
print_clean(crsr.execute("SELECT * FROM proj").fetchall())

    EID name
0     1   P1
1     2   P1
2     3   P2
3     1   P2
4     2   P3
5     1   P4
6     3   P5
7     5   P5
8     1   P1
9     2   P1
10    3   P2
11    1   P2
12    2   P3
13    1   P4
14    3   P5
15    5   P5
16    1   P1
17    2   P1
18    3   P2
19    1   P2
20    2   P3
21    1   P4
22    3   P5
23    5   P5

#LEFT join

In [ ]:
## practice joins here
#left join
print_clean(crsr.execute("SELECT emp.EID AS emp_EID, proj.EID AS proj_EID FROM emp LEFT JOIN proj ON proj.name = emp.name").fetchall())

    emp_EID proj_EID
0         1     None
1         2     None
2         3     None
3         4     None
4         1     None
5         2     None
6         3     None
7         4     None
8         1     None
9         2     None
10        3     None
11        4     None

#INNER join

In [ ]:
#Inner join
print_clean(crsr.execute("SELECT * FROM emp INNER JOIN proj ON proj.EID = emp.EID").fetchall())

#RIGHT JOIN

In [ ]:
#Right join
print_clean(crsr.execute("SELECT emp.EID AS emp_EID, proj.EID AS proj_EID FROM proj LEFT JOIN emp  ON proj.name = emp.name").fetchall())

#FULL OUTER JOIN

In [ ]:
# Full Outer join
print_clean(crsr.execute("""SELECT emp.EID, proj.EID FROM emp LEFT JOIN proj ON proj.name = emp.name
UNION
SELECT emp.EID, proj.EID FROM proj LEFT JOIN emp ON proj.name = emp.name""").fetchall())

#Create a table

In [ ]:
import sqlite3

connection = sqlite3.connect("mySchool.db")

crsr = connection.cursor()

In [ ]:
sql_command = """CREATE TABLE teacher( sttap_number INTEGER PRIMAY KEY,
fname VARCHAR(30),
lname VARCHAR(30),
subject CHAR(1),
joining_date DATE); """

crsr.execute(sql_command)

#Insert the data

In [ ]:
sql_command = """INSERT INTO teacher VALUES (23, "Dashrth", "Kumawat", "Hindi",10-10-2002);"""


crsr.execute(sql_command)

In [ ]:
sql_command = """INSERT INTO teacher VALUES (10, "Sonu", "Solanki", "English", 23-10-2003);"""

crsr.execute(sql_command)

connection.commit()

connection.close()

In [ ]:
connection = sqlite3.connect("mySchool.db")

crsr = connection.cursor()

#Fetching  the data

In [ ]:
crsr.execute("SELECT * FROM teacher ");

data = crsr.fetchall()

for i in data:
  print(i)

In [ ]:
crsr.execute("SELECT * FROM teacher  WHERE fname LIKE '%as%'").fetchall()

#update the data

In [ ]:
#update the student record
connection.execute("UPDATE teacher SET fname = 'Jivan' , lname = 'Suthar', joining_date = date('2002-10-10') WHERE sttap_number =23 ").fetchall()
connection.execute("UPDATE teacher SET joining_date=date('2005-03-23') where sttap_number = 10").fetchall()
connection.commit()

print("Total number of rows updated:",connection.total_changes)

data1 = connection.execute("SELECT * FROM teacher")
for i in data1:
  print(i)

#Deleting the data

In [ ]:

#delete the student reocrd from database
connection.execute("DELETE from teacher where sttap_number=23").fetchall()
connection.commit()

print("Total number of rows deleted:",connection.total_changes)

cursur = connection.execute("SELECT * FROM TEACHER")
for rows in cursur:
  print(rows)

 #connection.close()

In [ ]:
#currnet date and time
import sqlite3
import datetime

con = sqlite3.connect(":memory:")
cur = con.cursor()
cur.execute("create table test(d date, ts timestamp)")

today = datetime.date.today()
now = datetime.datetime.now()

cur.execute("insert into test(d, ts) values (?, ?)", (today, now))
cur.execute("select d, ts from test")
row = cur.fetchone()
print(today, "=>", row[0], type(row[0]))
print(now, "=>", row[1], type(row[1]))

cur.execute('select current_date as "d [date]", current_timestamp as "ts [timestamp]"')
row = cur.fetchone()
print("current_date", row[0], type(row[0]))
print("current_timestamp", row[1], type(row[1]))

con.close()

In [ ]:
crsr.execute("SELECT DATE('now')").fetchall()

In [ ]:
crsr.execute("SELECT time('now')").fetchall()

In [ ]:
crsr.execute("SELECT datetime('now')").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%Y', 'now')").fetchall()

#EXTRACT() Returns a single part of a date/time

In [ ]:
crsr.execute("SELECT strftime('%Y', 'now')").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%m', 'now')").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%d', 'now')").fetchall()

#DATE_ADD() Adds a specified time interval to a date

In [ ]:
crsr.execute("SELECT strftime('%Y-%m-%d %H:%M:%S', 'now', '+1 day')").fetchall()

#DATE_SUB() Subtracts a specified time interval from a date

In [ ]:
crsr.execute("SELECT strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 day')").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hours')").fetchall()

#DATEDIFF() Returns the number of days between two dates

In [ ]:

crsr.execute("SELECT (strftime('%Y', '2020-09-27')- strftime('%Y','2011-09-27')) AS DateDiff").fetchall()

In [ ]:
# Calculate the difference in years between two dates
crsr.execute("SELECT (strftime('%Y', '2020-09-27') - strftime('%Y', '2011-09-27')) AS DateDiff").fetchall()

#DATE_FORMAT() Displays date/time data in different formats

In [ ]:
crsr.execute("SELECT strftime('%Y', '2017-06-15')").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%Y %m %d', '2017-06-15')").fetchall()

In [ ]:
#crsr.execute("SELECT strftime('%W %M %e %Y', BirthDate) FROM teacher").fetchall()

# DATE_SUB() Function

In [ ]:
crsr.execute("SELECT strftime('%Y-%m-%d', datetime('2017-06-15', '-10 days'))").fetchall()

In [ ]:
crsr.execute("SELECT strftime('%Y-%m-%d %H:%M:%S', datetime('2017-06-15 09:34:21', '-15 minutes'))").fetchall()

#Types of SQL Commands
There are five types of SQL commands: DDL, DML, DCL, TCL, and DQL

In [ ]:
## SQL command to create a table named "Student"

#DDL-Data definition language
# create, drop, alter ,Truncate


import sqlite3

# Connect to the SQLite database (you may need to specify the database path)
conn = sqlite3.connect('myPersonal.db')
crsr = conn.cursor()


#Create - it is used  to create a table in the database
sql_command = """
CREATE TABLE student (
    Name VARCHAR(20),
    Email VARCHAR(100),
    DOB DATE
);
"""

# Execute the SQL command to create the table
crsr.execute(sql_command)

In [ ]:
student_dict = {
    "Name": ["Ankit", "Balram", "Chandu", "Dashrath"],
    "Email": ['dkkumawat@gmail.com', 'bkkumawat@gmail.com', 'ckkumawat@gmail.com', 'ankitkkumawat@gmail.com'],
    "DOB": ['2003-10-23', '2012-10-22', '2012-03-22', '2014-07-04']
}

# Iterate over the data in the dictionary and insert it into the table
for name, email, dob in zip(student_dict["Name"], student_dict["Email"], student_dict["DOB"]):
    sql_command = """INSERT INTO student (Email, Name, DOB) VALUES (?, ?, ?);"""
    crsr.execute(sql_command, (email, name, dob))

In [ ]:
print_clean(crsr.execute("SELECT * FROM student").fetchall())

In [ ]:
#Drop: It is used to delete both the structure and record stored in the table

table_to_drop = "student"
crsr.execute(f"DROP TABLE {table_to_drop}")
conn.commit()

#-------------------------------------------------------------------------